#pragma once

#include <windows.h>

#define GPMC_BASE_ADDR			0x6E000000
#define GPMC_DATA_BASE          0x00000000
#define GPMC_CS3_BASE           0x18000000
#define GPMC_CS1_BASE           0x08000000 //GPMC_CS1_BASE = GPMC_CS3_BASE/3


#define		IOCTL_WRITEREG					0x1001
#define		IOCTL_READREG					0x1002

typedef volatile struct
{
	UINT32 baseAddr;
	UINT32 offset;
	UINT32 value;
}RWRegData_t;

typedef volatile struct 
{
	DWORD GPMC_CONFIG1;//0
	DWORD GPMC_CONFIG2;//4
	DWORD GPMC_CONFIG3;//8
	DWORD GPMC_CONFIG4;//c
	DWORD GPMC_CONFIG5;//10
	DWORD GPMC_CONFIG6;//14
	DWORD GPMC_CONFIG7;//18
	DWORD GPMC_NAND_COMMAND;//1c
	DWORD GPMC_NAND_ADDRESS;//20
	DWORD GPMC_NAND_DATA;//24
	DWORD rez[2];//-->30
}GPMC_CONFIG_DATA_REGS;

typedef volatile struct 
{
	DWORD GPMC_BCH_RESULT0;//0
	DWORD GPMC_BCH_RESULT1;//4
	DWORD GPMC_BCH_RESULT2;//8
	DWORD GPMC_BCH_RESULT3;//c
}GPMC_BCH_RESULTS;

typedef volatile struct 
{
	DWORD GPMC_REVISION;
	DWORD rez1[3];//4,8,c
	DWORD GPMC_SYSCONFIG;//10
	DWORD GPMC_SYSSTATUS;//14
	DWORD GPMC_IRQSTATUS;//18
	DWORD GPMC_IRQENABLE;//1c
	DWORD rez2[8]; // (0x40-0x1c)/4 - 1
	DWORD GPMC_TIMEOUT_CONTROL;//40
	DWORD GPMC_ERR_ADDRESS;//44
	DWORD GPMC_ERR_TYPE;//48
	DWORD rez3;//4c
	DWORD GPMC_CONFIG;//50
	DWORD GPMC_STATUS;//54
	DWORD rez4[2];//58,5c
	GPMC_CONFIG_DATA_REGS GPMC_CONFIGDATA[8];
	DWORD GPMC_PREFETCH_CONFIG1;//1e0
	DWORD GPMC_PREFETCH_CONFIG2;//1e4
	DWORD rez5;//1e8
	DWORD GPMC_PREFETCH_CONTROL;//1ec
	DWORD GPMC_PREFETCH_STATUS; //1f0
	DWORD GPMC_ECC_CONFIG;	//1f4
	DWORD GPMC_ECC_CONTROL; //1f8
	DWORD GPMC_ECC_SIZE_CONFIG; //1fc
	DWORD GPMC_ECCj_RESULT[8]; //200->220
	DWORD rez6[8];
	GPMC_BCH_RESULTS GPMC_BCH_RESULTS[8]; //240
	DWORD rez7[4];
	DWORD GPMC_BCH_SWDATA;
} GPMC_REGS_t;

const DWORD GPMC_REGS_OFFSETMAX = sizeof(GPMC_REGS_t)-4;//36; 
 #define GPIO_REGS_OFFSETMAX 0x25
 #define GPMC_DATA_MAX  0x10 
